Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# codebaseMemory.panel.title
source: CodebaseMemory 3D Graph
ar: رسم CodebaseMemory ثلاثي الأبعاد
es: Gráfico 3D de CodebaseMemory
fr: Graphe 3D CodebaseMemory
id: Grafik 3D CodebaseMemory
it: Grafico 3D CodebaseMemory
ja: CodebaseMemory 3D グラフ
ko: CodebaseMemory 3D 그래프
nl: CodebaseMemory 3D-grafiek
pt_br: Gráfico 3D do CodebaseMemory
ru: CodebaseMemory 3D-граф
tr: CodebaseMemory 3B Grafik
uk: CodebaseMemory 3D-графік
vi: Đồ họa 3D CodebaseMemory
zh_hans: CodebaseMemory 3D 代码图谱
zh_hant: CodebaseMemory 3D 代码图谱

# codebaseMemory.status.downloading
source: Downloading…
ar: جارٍ التنزيل…
de: Wird heruntergeladen…
es: Descargando…
fr: Téléchargement…
id: Mengunduh…
it: Scaricamento…
ja: ダウンロード中…
ko: 다운로드 중…
nl: Bezig met downloaden…
pl: Pobieranie…
pt_br: Baixando…
ru: Загрузка…
tr: İndiriliyor…
uk: Завантаження…
vi: Đang tải xuống…
zh_hans: 下载中…
zh_hant: 下载中…

# codebaseMemory.status.extracting
source: Extracting…
ar: جارٍ الاستخراج…
de: Wird extrahiert…
es: Extrayendo…
fr: Extraction…
id: Mengekstrak…
it: Estrazione…
ja: 展開中…
ko: 추출 중…
nl: Bezig met uitpakken…
pl: Wyodrębnianie…
pt_br: Extraindo…
ru: Извлечение…
tr: Çıkarılıyor…
uk: Видобування…
vi: Đang giải nén…
zh_hans: 解压中…
zh_hant: 解压中…

# codebaseMemory.status.indexing
source: Indexing…
ar: جارٍ الفهرسة…
de: Wird indiziert…
es: Indexando…
fr: Indexation…
id: Mengindeks…
it: Indicizzazione…
ja: インデックス作成中…
ko: 인덱싱 중…
nl: Bezig met indexeren…
pl: Indeksowanie…
pt_br: Indexando…
ru: Индексация…
tr: Dizinleniyor…
uk: Індексація…
vi: Đang lập chỉ mục…
zh_hans: 索引中…
zh_hant: 索引中…

# codebaseMemory.status.ready
source: Ready
ar: جاهز
de: Bereit
es: Listo
fr: Prêt
id: Siap
it: Pronto
ja: 準備完了
ko: 준비 완료
nl: Gereed
pl: Gotowe
pt_br: Pronto
ru: Готово
tr: Hazır
uk: Готово
vi: Sẵn sàng
zh_hans: 就绪
zh_hant: 就绪

# codebaseMemory.status.startingUI
source: Starting UI…
ar: جارٍ بدء الواجهة…
de: Oberfläche wird gestartet…
es: Iniciando interfaz…
fr: Démarrage de l'interface…
id: Memulai UI…
it: Avvio interfaccia…
ja: UI を起動中…
ko: UI 시작 중…
nl: Interface wordt gestart…
pl: Uruchamianie interfejsu…
pt_br: Iniciando interface…
ru: Запуск интерфейса…
tr: Arayüz başlatılıyor…
uk: Запуск інтерфейсу…
vi: Đang khởi động giao diện…
zh_hans: 启动 UI…
zh_hant: 启动 UI…

# codebaseMemory.status.succeededFormat
source: Generation %d
ar: الجيل %d
es: Generación %d
fr: Génération %d
id: Generasi %d
it: Generazione %d
ja: 生成 %d
ko: 생성 %d
nl: Generatie %d
pl: Generacja %d
pt_br: Geração %d
ru: Генерация %d
tr: Oluşturma %d
uk: Генерація %d
vi: Lần tạo %d
zh_hans: 第 %d 次生成
zh_hant: 第 %d 次生成

# codebaseMemory.step.download.title
source: Download Archive
ar: تنزيل الأرشيف
de: Archiv herunterladen
es: Descargar archivo
fr: Télécharger l'archive
id: Unduh Arsip
it: Scarica archivio
ja: アーカイブをダウンロード
ko: 아카이브 다운로드
nl: Archief downloaden
pl: Pobierz archiwum
pt_br: Baixar Arquivo
ru: Загрузить архив
tr: Arşivi İndir
uk: Завантажити архів
vi: Tải xuống kho lưu trữ
zh_hans: 下载存档
zh_hant: 下载存档

# codebaseMemory.step.extract.title
source: Extract Source
ar: استخراج المصدر
de: Quelltext extrahieren
es: Extraer fuente
fr: Extraire les sources
id: Ekstrak Sumber
it: Estrai sorgente
ja: ソースを展開
ko: 소스 추출
nl: Broncode uitpakken
pl: Wyodrębnij źródło
pt_br: Extrair Código-fonte
ru: Извлечь исходный код
tr: Kaynağı Çıkar
uk: Видобути вихідний код
vi: Giải nén mã nguồn
zh_hans: 解压源码
zh_hant: 解压源码

# codebaseMemory.step.index.title
source: Index Repository
ar: فهرسة المستودع
de: Repository indizieren
es: Indexar repositorio
fr: Indexer le dépôt
id: Indeks Repositori
it: Indicizza repository
ja: リポジトリをインデックス
ko: 저장소 인덱싱
nl: Repository indexeren
pl: Indeksuj repozytorium
pt_br: Indexar Repositório
ru: Индексировать репозиторий
tr: Depoyu Dizinle
uk: Індексувати репозиторій
vi: Lập chỉ mục kho
zh_hans: 索引仓库
zh_hant: 索引仓库

# codebaseMemory.step.openBrowser.title
source: Open Browser
ar: فتح المتصفح
de: Browser öffnen
es: Abrir navegador
fr: Ouvrir le navigateur
id: Buka Browser
it: Apri browser
ja: ブラウザを開く
ko: 브라우저 열기
nl: Browser openen
pl: Otwórz przeglądarkę
pt_br: Abrir Navegador
ru: Открыть браузер
tr: Tarayıcıyı Aç
uk: Відкрити браузер
vi: Mở trình duyệt
zh_hans: 打开浏览器
zh_hant: 打开浏览器

# codebaseMemory.step.resolveBinary.title
source: Verify Binary
ar: التحقق من الملف الثنائي
de: Binärdatei überprüfen
es: Verificar binario
fr: Vérifier le binaire
id: Verifikasi Biner
it: Verifica binario
ja: バイナリを検証
ko: 바이너리 확인
nl: Binair bestand controleren
pl: Zweryfikuj plik binarny
pt_br: Verificar Binário
ru: Проверить бинарный файл
tr: İkili Dosyayı Doğrula
uk: Перевірити бінарний файл
vi: Xác minh tệp nhị phân
zh_hans: 验证二进制
zh_hant: 验证二进制

# codebaseMemory.step.resolveRevision.title
source: Resolve Revision
ar: حل المراجعة
de: Revision auflösen
es: Resolver revisión
fr: Résoudre la révision
id: Selesaikan Revisi
it: Risolvi revisione
ja: リビジョンを解決
ko: 리비전 확인
nl: Revisie oplossen
pl: Rozpoznaj rewizję
pt_br: Resolver Revisão
ru: Определить ревизию
tr: Revizyonu Çözümle
uk: Визначити ревізію
vi: Xác định phiên bản
zh_hans: 解析版本
zh_hant: 解析版本

# codebaseMemory.step.startUI.title
source: Start UI Server
ar: بدء خادم الواجهة
de: UI-Server starten
es: Iniciar servidor de interfaz
fr: Démarrer le serveur UI
id: Mulai Server UI
it: Avvia server interfaccia
ja: UI サーバーを起動
ko: UI 서버 시작
nl: UI-server starten
pl: Uruchom serwer interfejsu
pt_br: Iniciar Servidor da Interface
ru: Запустить сервер интерфейса
tr: UI Sunucusunu Başlat
uk: Запустити сервер інтерфейсу
vi: Khởi động máy chủ giao diện
zh_hans: 启动 UI 服务
zh_hant: 启动 UI 服务

# codebaseMemory.storage.error.invalidBookmark
source: The CodebaseMemory bookmark is no longer valid.
ar: العلامة المرجعية لـ CodebaseMemory لم تعد صالحة.
de: Das CodebaseMemory-Lesezeichen ist nicht mehr gültig.
es: El marcador de CodebaseMemory ya no es válido.
fr: Le signet CodebaseMemory n'est plus valide.
id: Bookmark CodebaseMemory tidak lagi valid.
it: Il segnalibro di CodebaseMemory non è più valido.
ja: CodebaseMemory のブックマークが無効になりました。
ko: CodebaseMemory 북마크가 더 이상 유효하지 않습니다.
nl: De CodebaseMemory-bladwijzer is niet langer geldig.
pl: Zakładka CodebaseMemory nie jest już ważna.
pt_br: O marcador do CodebaseMemory não é mais válido.
ru: Закладка CodebaseMemory больше недействительна.
tr: CodebaseMemory yer imi artık geçerli değil.
uk: Закладка CodebaseMemory більше не дійсна.
vi: Dấu trang CodebaseMemory không còn hợp lệ.
zh_hans: CodebaseMemory 书签已失效。
zh_hant: CodebaseMemory 书签已失效。

# codebaseMemory.storage.error.outputDirectoryUnavailable
source: The CodebaseMemory output directory is unavailable.
ar: دليل الإخراج لـ CodebaseMemory غير متاح.
de: Das CodebaseMemory-Ausgabeverzeichnis ist nicht verfügbar.
es: El directorio de salida de CodebaseMemory no está disponible.
fr: Le répertoire de sortie CodebaseMemory est indisponible.
id: Direktori output CodebaseMemory tidak tersedia.
it: La directory di output di CodebaseMemory non è disponibile.
ja: CodebaseMemory の出力ディレクトリが利用できません。
ko: CodebaseMemory 출력 디렉토리를 사용할 수 없습니다.
nl: De uitvoermap van CodebaseMemory is niet beschikbaar.
pl: Katalog wyjściowy CodebaseMemory jest niedostępny.
pt_br: O diretório de saída do CodebaseMemory está indisponível.
ru: Каталог вывода CodebaseMemory недоступен.
tr: CodebaseMemory çıktı dizini kullanılamıyor.
uk: Каталог виводу CodebaseMemory недоступний.
vi: Thư mục đầu ra của CodebaseMemory không khả dụng.
zh_hans: CodebaseMemory 输出目录不可用。
zh_hant: CodebaseMemory 输出目录不可用。

# codebaseMemory.version.branchChangedFormat
source: Branch changed: %1$@ → %2$@
ar: تغير الفرع: %1$@ → %2$@
de: Branch geändert: %1$@ → %2$@
es: Rama cambiada: %1$@ → %2$@
fr: Branche changée : %1$@ → %2$@
id: Cabang berubah: %1$@ → %2$@
it: Branch cambiato: %1$@ → %2$@
ja: ブランチが変更されました: %1$@ → %2$@
ko: 브랜치 변경: %1$@ → %2$@
nl: Branch gewijzigd: %1$@ → %2$@
pl: Gałąź zmieniona: %1$@ → %2$@
pt_br: Branch alterada: %1$@ → %2$@
ru: Ветка изменена: %1$@ → %2$@
tr: Dal değişti: %1$@ → %2$@
uk: Гілка змінена: %1$@ → %2$@
vi: Nhánh đã thay đổi: %1$@ → %2$@
zh_hans: 分支已变更：%1$@ → %2$@
zh_hant: 分支已变更：%1$@ → %2$@

# codebaseMemory.version.checking
source: Checking…
ar: جارٍ التحقق…
de: Wird überprüft…
es: Verificando…
fr: Vérification…
id: Memeriksa…
it: Controllo…
ja: 確認中…
ko: 확인 중…
nl: Bezig met controleren…
pl: Sprawdzanie…
pt_br: Verificando…
ru: Проверка…
tr: Kontrol ediliyor…
uk: Перевірка…
vi: Đang kiểm tra…
zh_hans: 检查中…
zh_hant: 检查中…

# codebaseMemory.version.current
source: Up to date
ar: محدث
de: Aktuell
es: Actualizado
fr: À jour
id: Terbaru
it: Aggiornato
ja: 最新です
ko: 최신 상태
nl: Actueel
pl: Aktualne
pt_br: Atualizado
ru: Актуально
tr: Güncel
uk: Актуально
vi: Đã cập nhật
zh_hans: 已是最新
zh_hant: 已是最新

# codebaseMemory.version.updateAvailableFormat
source: New commits: %1$@ → %2$@
ar: التزامات جديدة: %1$@ → %2$@
de: Neue Commits: %1$@ → %2$@
es: Nuevos commits: %1$@ → %2$@
fr: Nouveaux commits : %1$@ → %2$@
id: Komit baru: %1$@ → %2$@
it: Nuovi commit: %1$@ → %2$@
ja: 新しいコミット: %1$@ → %2$@
ko: 새 커밋: %1$@ → %2$@
nl: Nieuwe commits: %1$@ → %2$@
pl: Nowe zatwierdzenia: %1$@ → %2$@
pt_br: Novos commits: %1$@ → %2$@
ru: Новые коммиты: %1$@ → %2$@
tr: Yeni commitler: %1$@ → %2$@
uk: Нові коміти: %1$@ → %2$@
vi: Commit mới: %1$@ → %2$@
zh_hans: 有新提交：%1$@ → %2$@
zh_hant: 有新提交：%1$@ → %2$@

# codeFlow.action.open
source: Open code graph
ar: فتح الرسم البياني للكود
de: Code-Graph öffnen
es: Abrir grafo de código
fr: Ouvrir le graphe de code
id: Buka grafik kode
it: Apri grafo del codice
ja: コードグラフを開く
ko: 코드 그래프 열기
nl: Codegrafiek openen
pl: Otwórz graf kodu
pt_br: Abrir grafo de código
ru: Открыть граф кода
tr: Kod grafiğini aç
uk: Відкрити граф коду
vi: Mở đồ thị mã
zh_hans: 打开代码图谱
zh_hant: 開啟程式碼圖譜

# codeFlow.action.openExisting
source: Open existing graph
ar: فتح الرسم البياني الحالي
de: Vorhandenen Graphen öffnen
es: Abrir grafo existente
fr: Ouvrir un graphe existant
id: Buka grafik yang ada
it: Apri grafo esistente
ja: 既存のグラフを開く
ko: 기존 그래프 열기
nl: Bestaande grafiek openen
pl: Otwórz istniejący graf
pt_br: Abrir grafo existente
ru: Открыть существующий граф
tr: Mevcut grafiği aç
uk: Відкрити існуючий граф
vi: Mở đồ thị hiện có
zh_hans: 打开已有图谱
zh_hant: 開啟現有圖譜

# codeFlow.action.regenerate
source: Re-generate
ar: إعادة التوليد
de: Neu generieren
es: Regenerar
fr: Régénérer
id: Hasilkan ulang
it: Rigenera
ja: 再生成
ko: 재생성
nl: Opnieuw genereren
pl: Wygeneruj ponownie
pt_br: Gerar novamente
ru: Перегенерировать
tr: Yeniden oluştur
uk: Згенерувати заново
vi: Tạo lại
zh_hans: 重新生成
zh_hant: 重新產生

# codeFlow.action.retry
source: Retry
ar: إعادة المحاولة
de: Wiederholen
es: Reintentar
fr: Réessayer
id: Coba lagi
it: Riprova
ja: 再試行
ko: 재시도
nl: Opnieuw proberen
pl: Ponów
pt_br: Tentar novamente
ru: Повторить
tr: Tekrar dene
uk: Повторити
vi: Thử lại
zh_hans: 重试
zh_hant: 重試

# codeFlow.branchPicker.searchPlaceholder
source: Search branches
ar: البحث في الفروع
de: Branches durchsuchen
es: Buscar ramas
fr: Rechercher des branches
id: Cari cabang
it: Cerca rami
ja: ブランチを検索
ko: 브랜치 검색
nl: Zoek branches
pl: Szukaj gałęzi
pt_br: Buscar branches
ru: Поиск веток
tr: Dalları ara
uk: Пошук гілок
vi: Tìm kiếm nhánh
zh_hans: 搜索分支
zh_hant: 搜尋分支

# codeFlow.branchPicker.selectPrompt
source: Choose branch
ar: اختر فرعًا
de: Branch auswählen
es: Elegir rama
fr: Choisir une branche
id: Pilih cabang
it: Scegli ramo
ja: ブランチを選択
ko: 브랜치 선택
nl: Kies branch
pl: Wybierz gałąź
pt_br: Escolher branch
ru: Выберите ветку
tr: Dal seçin
uk: Виберіть гілку
vi: Chọn nhánh
zh_hans: 选择分支
zh_hant: 選擇分支

# codeFlow.error.archiveTooLarge
source: Repository ZIP exceeds the configured download limit.
ar: يتجاوز ملف ZIP للمستودع حد التنزيل المحدد.
de: Repository-ZIP überschreitet das konfigurierte Download-Limit.
es: El ZIP del repositorio supera el límite de descarga configurado.
fr: Le ZIP du dépôt dépasse la limite de téléchargement configurée.
id: ZIP repositori melebihi batas unduhan yang ditentukan.
it: Il file ZIP del repository supera il limite di download configurato.
ja: リポジトリのZIPが設定されたダウンロード制限を超えています。
ko: 저장소 ZIP이 설정된 다운로드 제한을 초과했습니다.
nl: Repository-ZIP overschrijdt de ingestelde downloadlimiet.
pl: Archiwum ZIP repozytorium przekracza skonfigurowany limit pobierania.
pt_br: O ZIP do repositório excede o limite de download configurado.
ru: ZIP-архив репозитория превышает установленный лимит загрузки.
tr: Depo ZIP'i yapılandırılmış indirme sınırını aşıyor.
uk: ZIP-архів репозиторію перевищує встановлену межу завантаження.
vi: Tệp ZIP kho lưu trữ vượt quá giới hạn tải xuống đã cấu hình.
zh_hans: 仓库 ZIP 超过当前配置的下载上限。
zh_hant: 倉庫 ZIP 超過設定的下載上限。

# codeFlow.error.branchMissing
source: The repository has no branches available for CodeFlow.
ar: لا توجد فروع متاحة في المستودع لـ CodeFlow.
de: Das Repository hat keine für CodeFlow verfügbaren Branches.
es: El repositorio no tiene ramas disponibles para CodeFlow.
fr: Le dépôt n'a aucune branche disponible pour CodeFlow.
id: Repositori tidak memiliki cabang yang tersedia untuk CodeFlow.
it: Il repository non ha rami disponibili per CodeFlow.
ja: このリポジトリにはCodeFlowで利用可能なブランチがありません。
ko: 저장소에 CodeFlow에 사용할 수 있는 브랜치가 없습니다.
nl: De repository heeft geen branches beschikbaar voor CodeFlow.
pl: Repozytorium nie ma dostępnych gałęzi dla CodeFlow.
pt_br: O repositório não possui branches disponíveis para o CodeFlow.
ru: В репозитории нет веток, доступных для CodeFlow.
tr: Depoda CodeFlow için uygun dal bulunmuyor.
uk: У репозиторію немає гілок, доступних для CodeFlow.
vi: Kho lưu trữ không có nhánh nào khả dụng cho CodeFlow.
zh_hans: 仓库没有可用于生成代码图谱的分支。
zh_hant: 倉庫沒有可用於 CodeFlow 的分支。

# codeFlow.error.branchNotFoundFormat
source: Branch %@ no longer exists. Please choose another branch.
ar: الفرع %@ لم يعد موجودًا. يرجى اختيار فرع آخر.
de: Branch %@ existiert nicht mehr. Bitte wählen Sie einen anderen Branch.
es: La rama %@ ya no existe. Elige otra rama.
fr: La branche %@ n'existe plus. Veuillez choisir une autre branche.
id: Cabang %@ sudah tidak ada. Silakan pilih cabang lain.
it: Il ramo %@ non esiste più. Scegli un altro ramo.
ja: ブランチ%@はもう存在しません。別のブランチを選択してください。
ko: 브랜치 %@이(가) 더 이상 존재하지 않습니다. 다른 브랜치를 선택하세요.
nl: Branch %@ bestaat niet meer. Kies een andere branch.
pl: Gałąź %@ już nie istnieje. Wybierz inną gałąź.
pt_br: O branch %@ não existe mais. Escolha outro branch.
ru: Ветка %@ больше не существует. Выберите другую ветку.
tr: %@ dalı artık mevcut değil. Lütfen başka bir dal seçin.
uk: Гілка %@ більше не існує. Виберіть іншу гілку.
vi: Nhánh %@ không còn tồn tại. Vui lòng chọn nhánh khác.
zh_hans: 生成分支 %@ 已不存在，请选择其它分支。
zh_hant: 分支 %@ 已不存在，請選擇其他分支。

# codeFlow.error.browserOpenFailed
source: The default browser could not open the CodeFlow page.
ar: تعذر على المتصفح الافتراضي فتح صفحة CodeFlow.
de: Der Standardbrowser konnte die CodeFlow-Seite nicht öffnen.
es: El navegador predeterminado no pudo abrir la página de CodeFlow.
fr: Le navigateur par défaut n'a pas pu ouvrir la page CodeFlow.
id: Browser default tidak dapat membuka halaman CodeFlow.
it: Il browser predefinito non ha potuto aprire la pagina CodeFlow.
ja: デフォルトのブラウザでCodeFlowページを開けませんでした。
ko: 기본 브라우저에서 CodeFlow 페이지를 열 수 없습니다.
nl: De standaardbrowser kon de CodeFlow-pagina niet openen.
pl: Domyślna przeglądarka nie mogła otworzyć strony CodeFlow.
pt_br: O navegador padrão não pôde abrir a página do CodeFlow.
ru: Браузеру по умолчанию не удалось открыть страницу CodeFlow.
tr: Varsayılan tarayıcı CodeFlow sayfasını açamadı.
uk: Типовий браузер не зміг відкрити сторінку CodeFlow.
vi: Trình duyệt mặc định không thể mở trang CodeFlow.
zh_hans: 默认浏览器无法打开 CodeFlow 页面。
zh_hant: 預設瀏覽器無法開啟 CodeFlow 頁面。

# codeFlow.error.emptyArchive
source: GitHub returned an empty ZIP file.
ar: أعاد GitHub ملف ZIP فارغًا.
de: GitHub hat eine leere ZIP-Datei zurückgegeben.
es: GitHub devolvió un archivo ZIP vacío.
fr: GitHub a renvoyé un fichier ZIP vide.
id: GitHub mengembalikan file ZIP kosong.
it: GitHub ha restituito un file ZIP vuoto.
ja: GitHubから空のZIPファイルが返されました。
ko: GitHub에서 빈 ZIP 파일을 반환했습니다.
nl: GitHub retourneerde een leeg ZIP-bestand.
pl: GitHub zwrócił pusty plik ZIP.
pt_br: O GitHub retornou um arquivo ZIP vazio.
ru: GitHub вернул пустой ZIP-файл.
tr: GitHub boş bir ZIP dosyası döndürdü.
uk: GitHub повернув порожній ZIP-файл.
vi: GitHub trả về tệp ZIP rỗng.
zh_hans: GitHub 返回了空的 ZIP 文件。
zh_hant: GitHub 傳回了空的 ZIP 檔案。

# codeFlow.error.invalidGitHubURL
source: Unable to construct the GitHub API URL.
ar: تعذر إنشاء عنوان URL لواجهة GitHub API.
de: Die GitHub-API-URL konnte nicht erstellt werden.
es: No se puede construir la URL de la API de GitHub.
fr: Impossible de construire l'URL de l'API GitHub.
id: Tidak dapat membuat URL API GitHub.
it: Impossibile costruire l'URL dell'API GitHub.
ja: GitHub APIのURLを構築できません。
ko: GitHub API URL을 구성할 수 없습니다.
nl: Kan de GitHub API-URL niet opbouwen.
pl: Nie można skonstruować adresu URL API GitHub.
pt_br: Não foi possível construir a URL da API do GitHub.
ru: Не удалось сформировать URL API GitHub.
tr: GitHub API URL'si oluşturulamıyor.
uk: Не вдалося сформувати URL API GitHub.
vi: Không thể xây dựng URL API GitHub.
zh_hans: 无法生成 GitHub API 地址。
zh_hant: 無法產生 GitHub API 位址。

# codeFlow.error.invalidTemplate
source: The CodeFlow page lacks the Starcat ZIP injection point.
ar: تفتقر صفحة CodeFlow إلى نقطة حقن Starcat ZIP.
de: Der CodeFlow-Seite fehlt der Starcat-ZIP-Injektionspunkt.
es: La página de CodeFlow carece del punto de inyección ZIP de Starcat.
fr: La page CodeFlow ne contient pas le point d'injection ZIP de Starcat.
id: Halaman CodeFlow tidak memiliki titik injeksi ZIP Starcat.
it: Alla pagina CodeFlow manca il punto di iniezione ZIP di Starcat.
ja: CodeFlowページにStarcat ZIPインジェクションポイントがありません。
ko: CodeFlow 페이지에 Starcat ZIP 삽입 지점이 없습니다.
nl: De CodeFlow-pagina mist het Starcat ZIP-injectiepunt.
pl: Strona CodeFlow nie zawiera punktu wstrzykiwania ZIP Starcat.
pt_br: A página do CodeFlow não possui o ponto de injeção ZIP do Starcat.
ru: На странице CodeFlow отсутствует точка внедрения ZIP от Starcat.
tr: CodeFlow sayfasında Starcat ZIP enjeksiyon noktası eksik.
uk: Сторінка CodeFlow не містить точки вставки ZIP від Starcat.
vi: Trang CodeFlow thiếu điểm chèn ZIP của Starcat.
zh_hans: CodeFlow 页面缺少 Starcat ZIP 注入入口。
zh_hant: CodeFlow 頁面缺少 Starcat ZIP 注入點。

# codeFlow.error.privateRepository
source: The first version of CodeFlow only supports public repositories.
ar: الإصدار الأول من CodeFlow يدعم المستودعات العامة فقط.
de: Die erste Version von CodeFlow unterstützt nur öffentliche Repositories.
es: La primera versión de CodeFlow solo admite repositorios públicos.
fr: La première version de CodeFlow ne prend en charge que les dépôts publics.
id: Versi pertama CodeFlow hanya mendukung repositori publik.
it: La prima versione di CodeFlow supporta solo repository pubblici.
ja: CodeFlowの初版はパブリックリポジトリのみをサポートしています。
ko: CodeFlow의 첫 번째 버전은 공개 저장소만 지원합니다.
nl: De eerste versie van CodeFlow ondersteunt alleen openbare repositories.
pl: Pierwsza wersja CodeFlow obsługuje tylko publiczne repozytoria.
pt_br: A primeira versão do CodeFlow suporta apenas repositórios públicos.
ru: Первая версия CodeFlow поддерживает только публичные репозитории.
tr: CodeFlow'un ilk sürümü yalnızca herkese açık depoları destekler.
uk: Перша версія CodeFlow підтримує лише публічні репозиторії.
vi: Phiên bản đầu tiên của CodeFlow chỉ hỗ trợ kho lưu trữ công khai.
zh_hans: 首版代码图谱仅支持公开仓库。
zh_hant: 首版程式碼圖譜僅支援公開倉庫。

# codeFlow.error.requestFailedFormat
source: GitHub request failed (HTTP %d).
ar: فشل طلب GitHub (HTTP %d).
de: GitHub-Anfrage fehlgeschlagen (HTTP %d).
es: La solicitud a GitHub falló (HTTP %d).
fr: La requête GitHub a échoué (HTTP %d).
id: Permintaan GitHub gagal (HTTP %d).
it: Richiesta a GitHub fallita (HTTP %d).
ja: GitHubリクエストが失敗しました（HTTP %d）。
ko: GitHub 요청 실패 (HTTP %d).
nl: GitHub-verzoek mislukt (HTTP %d).
pl: Żądanie do GitHub nie powiodło się (HTTP %d).
pt_br: Falha na requisição ao GitHub (HTTP %d).
ru: Запрос к GitHub не удался (HTTP %d).
tr: GitHub isteği başarısız oldu (HTTP %d).
uk: Запит до GitHub не вдався (HTTP %d).
vi: Yêu cầu GitHub thất bại (HTTP %d).
zh_hans: GitHub 请求失败（HTTP %d）。
zh_hant: GitHub 請求失敗（HTTP %d）。

# codeFlow.error.templateMissing
source: The Starcat bundle is missing the CodeFlow page.
ar: حزمة Starcat تفتقد صفحة CodeFlow.
de: Das Starcat-Bundle enthält keine CodeFlow-Seite.
es: Falta la página de CodeFlow en el paquete de Starcat.
fr: Le bundle Starcat ne contient pas la page CodeFlow.
id: Bundel Starcat tidak memiliki halaman CodeFlow.
it: Manca la pagina CodeFlow nel bundle di Starcat.
ja: StarcatバンドルにCodeFlowページがありません。
ko: Starcat 번들에 CodeFlow 페이지가 없습니다.
nl: Het Starcat-bundel mist de CodeFlow-pagina.
pl: W pakiecie Starcat brakuje strony CodeFlow.
pt_br: O pacote do Starcat não contém a página do CodeFlow.
ru: В пакете Starcat отсутствует страница CodeFlow.
tr: Starcat paketinde CodeFlow sayfası eksik.
uk: У пакеті Starcat відсутня сторінка CodeFlow.
vi: Gói Starcat thiếu trang CodeFlow.
zh_hans: Starcat 安装包中缺少 CodeFlow 页面。
zh_hant: Starcat 安裝套件中缺少 CodeFlow 頁面。

# codeFlow.overview.download.detail
source: Pinned-commit shared snapshot
ar: لقطة مشتركة مثبتة عند commit محدد
de: Pinned-Commit gemeinsam genutzter Snapshot
es: Instantánea compartida de un commit fijo
fr: Instantané partagé d'un commit épinglé
id: Snapshot bersama dengan commit tetap
it: Snapshot condiviso del commit fissato
ja: 固定コミットの共有スナップショット
ko: 고정 커밋 공유 스냅샷
nl: Vastgelegde commit gedeelde momentopname
pl: Migawka współdzielona z przypiętym zatwierdzeniem
pt_br: Snapshot compartilhado de commit fixo
ru: Общий снимок с фиксированным коммитом
tr: Sabitlenmiş işlemin paylaşılan anlık görüntüsü
uk: Знімок спільного використання з фіксованим комітом
vi: Ảnh chụp nhanh được ghim chung
zh_hans: 固定 commit 共享快照
zh_hant: 固定 commit 共享快照

# codeFlow.overview.download.title
source: Download repository ZIP
ar: تنزيل ZIP المستودع
de: Repository-ZIP herunterladen
es: Descargar ZIP del repositorio
fr: Télécharger le ZIP du dépôt
id: Unduh ZIP repositori
it: Scarica ZIP del repository
ja: リポジトリZIPをダウンロード
ko: 저장소 ZIP 다운로드
nl: Repository-ZIP downloaden
pl: Pobierz archiwum ZIP repozytorium
pt_br: Baixar ZIP do repositório
ru: Загрузить ZIP репозитория
tr: Depo ZIP'ini indir
uk: Завантажити ZIP репозиторію
vi: Tải xuống tệp ZIP kho lưu trữ
zh_hans: 下载仓库 ZIP
zh_hant: 下載倉庫 ZIP

# codeFlow.overview.openBrowser.detail
source: Display the code graph in the default browser
ar: عرض الرسم البياني للكود في المتصفح الافتراضي
de: Code-Graph im Standardbrowser anzeigen
es: Mostrar el grafo de código en el navegador predeterminado
fr: Afficher le graphe de code dans le navigateur par défaut
id: Tampilkan grafik kode di browser default
it: Mostra il grafo del codice nel browser predefinito
ja: デフォルトブラウザでコードグラフを表示
ko: 기본 브라우저에 코드 그래프 표시
nl: Toon de codegrafiek in de standaardbrowser
pl: Wyświetl graf kodu w domyślnej przeglądarce
pt_br: Exibir o grafo de código no navegador padrão
ru: Показать граф кода в браузере по умолчанию
tr: Kod grafiğini varsayılan tarayıcıda görüntüle
uk: Відобразити граф коду в типовому браузері
vi: Hiển thị đồ thị mã trong trình duyệt mặc định
zh_hans: 使用默认浏览器展示代码图谱
zh_hant: 使用預設瀏覽器展示程式碼圖譜

# codeFlow.overview.openBrowser.title
source: Open in browser
ar: فتح في المتصفح
de: Im Browser öffnen
es: Abrir en el navegador
fr: Ouvrir dans le navigateur
id: Buka di browser
it: Apri nel browser
ja: ブラウザで開く
ko: 브라우저에서 열기
nl: Openen in browser
pl: Otwórz w przeglądarce
pt_br: Abrir no navegador
ru: Открыть в браузере
tr: Tarayıcıda aç
uk: Відкрити в браузері
vi: Mở trong trình duyệt
zh_hans: 浏览器打开
zh_hant: 在瀏覽器中開啟
